{
  "chapters": [
    {
      "chaptersid": 1,
      "content": "<div class='text text-h4 text-weight-regular q-mt-lg'>Introduction</div><figcaption class='text-weight-light text-italic q-mt-xs q-mb-lg'>  - Environment und Setup</figcaption><!--Header End--><!--Section 1--><div><div class='text text-h6 text-weight-regular q-my-md'>Um Webseiten zu programmieren braucht man eigentlich nicht viel mehr als einen Texteditor und eine funktionierende Tastatur (eine Maus wäre natürlich auch zu empfehlen).</div><div class='text text-h6 text-weight-regular q-my-md'>Jedoch heißt das aber auch, viel Syntax auswendig lernen zu müssen. Und dafür sind wir schließlich nicht hier.</div><div class='w-100 flex justify-center'><img src='lections/introduction/Introduction_text-editor_1.PNG' class='q-my-lg image' /></div><div class='text text-h6 text-weight-regular q-my-md'>Und visuell haut uns dieser Texteditor auch nicht vom Hocker! Selbst ich kenne mich da bei meinem eigenen Code gleich kaum noch aus.</div><div class='text text-h6 text-weight-regular q-my-md'>Und sprechen wir gar nicht erst vom horizontalen und vertikalen Scroll-Erlebnis, denn erleben möchte man das wohl eher kaum.</div><div class='text text-h6 text-weight-regular q-my-md'>Mit Anwendungen wie<a href='https://code.visualstudio.com/'>Visual Studio Code</a> können wir uns aber viele dieser Mühen ersparen.</div><div class='text text-h6 text-weight-regular q-my-md'>Zusätzlich erleichtert es uns auch, unseren Code später lokal zu hosten und auszuprobieren.</div><div class='text text-h6 text-weight-regular q-my-md'>Darum, oft ungerne gesehen und meistens recht unspannend, folgt nun ein kleines Tutorial zum Setup unseres Environments, wie die Vorstellung eines weiteren kleinen Gadgets, welches wir gerne mal im Laufe der Lektionen verwenden.</div><hr /><div class='text text-h6 text-weight-bold q-my-md'>Visual Studio Code:</div><div class='text text-h6 text-weight-regular q-my-md'>Zuerst sollte man wissen, dass Visual Studio Code selbst entweder lokal, also nach einem Download direkt am Computer, somit auch ohne notwendige Internetverbindung, oder übers Web, also im Browser, laufen kann.</div><div class='text text-h6 text-weight-regular q-my-md'>Wir wollen jedoch Visual Studio Code nun offline nutzen, da einige Erweiterungen und coole Features im Web nicht unterstützt werden.</div><div class='text text-italic text-h6 text-weight-light q-my-md'>Für all welche, die jedoch sich mit der Browserversion beschäftigen wollen:<a href='https://code.visualstudio.com/'>Visual Studio Code Web</a>.</div><div class='text text-h6 text-weight-regular q-my-md'>Kommen wir jedoch zum Download, Nach einer kleinen typischen und geliebten Prozedur des Leidens sollte Visual Studio Code ähnlich dem gleichen:</div><div class='w-100 flex justify-center'><img src='lections/introduction/Introduction_visual-studio-code_1.PNG' class='q-my-lg image'/></div><div class='text text-h6 text-weight-regular q-my-md'>Falls der Hintergrund etwas heller und augenstechender ist einfach Strg+K und danach Strg+T drücken.</div><div class='text text-h6 text-weight-regular q-my-md'>Im folgenden Menü können wir dann das Color Theme von Visual Studio Code ändern.</div><div class='text text-h6 text-weight-regular q-my-md'>Keine Sorge, falls keines deinem Geschmack entspricht gibt es dutzend unter Erweiterungen zum Installieren.</div><div class='text text-h6 text-weight-regular q-my-md'>Und zum Thema Erweiterungen. Erweiterungen sind, was Visual Studio Code ausmacht, denn durch diese können wir Hilfen und visuelle Goodies uns unter den Nagel reißen.</div><div class='text text-h6 text-weight-regular q-my-md'>Einige Erlesene wissen das hier sicherlich schon, aber Visual Studio Code wurde nicht nur für HTML gemacht, sondern kann auch Programmiersprachen wie Python oder Frameworks wie Vue.js unterstützen, jedoch nur, solange man auch die richtigen Erweiterungeninstalliert hat!</div><hr /><div class='w-100 flex justify-center'><img src='lections/introduction/Introduction_visual-studio-code-extensions_1.png' class='q-my-lg image'/></div><div class='text text-h6 text-weight-regular q-my-md'>Als allererstes, auch wenn es wirklich simpel ist, so sieht das Zeichen für Erweiterungen aus und so auch das Menü.</div><div class='text text-h6 text-weight-regular q-my-md'>Suchen und wie man den “Installieren” Button zu klicken hat, muss ich hoffentlich nicht weiter erläutern :)</div><div class='text text-h6 text-weight-regular q-my-md'>Darum eine kleine Checkliste für euch:</div><div class='text text-h6 text-weight-regular q-my-md'><ul class='lineList'><li>Live Preview (optional) - Microsoft</li><li>Live Server - Ritwick Dey</li><li>Prettier - Code formatter - Prettier</li><li>Auto Close Tag - Jun Han</li><li>Auto Rename Tag - Jun Han</li><li>Highlight Matching Tag - vincaslt</li><li>HTML CSS Support - ecmel</li><li>htmltagwrap - Brad Gashler</li><li>IntelliSense for CSS class names in HTML - Zignd</li><li>JavaScript (ES6) code snippets - charalampos karypidis</li></ul></div><div class='text text-h6 text-weight-regular q-my-md'>Sooo, das waren jetzt zwar ein paar Extensions, aber hey, wenigstens sind sie klein und schnell zum herunterladen :)</div><div class='text text-h6 text-weight-regular q-my-md'>Und was jetzt? Naja, der Rest in Visual Studio Code ist ziemlich selbst erklärend.</div><div class='text text-h6 text-weight-regular q-my-md'>Über “File” kann man einen Ordner oder ein File öffnen und mit Rechtsklick auf ein File kann man tolle Sachen mit diesem machen, wie zum Beispiel unseren Live-Server starten.</div><div class='text text-h6 text-weight-regular q-my-md'>Beim Hovern über einem Ordner fallen einem vielleicht noch ein paar kleine Symbole auf, welche man anklicken könnte (kann sicher nicht schaden, das einmal auszuprobieren).</div><div class='text text-h6 text-weight-regular q-my-md'>Aber ansonsten sind wir hier erst mal fertig!</div><hr /><div class='text text-h6 text-weight-regular q-my-md'>Aber hey, hab ich nicht irgendwas von einem kleinen Gadget gesagt?</div><div class='text text-h6 text-weight-regular q-my-md'>Natürlich hab ich das, also lasst uns<a href='https://codepen.io/your-work'> CodePen</a> willkommen heißen!</div><div class='text text-h6 text-weight-regular q-my-md'> Nicht immer wollen oder müssen wir lokal über Visual Studio Code arbeiten, auch wenn das natürlich immer schön ist, wollen wir ja ein bisschen Mobilität in den Alltag bringen.</div><div class='text text-h6 text-weight-regular q-my-md'>Über CodePen kannst du nun ganz einfach über unser Profil die verschiedensten Aufgaben finden und lösen, alles ohne an einem Rechner sitzen zu müssen.</div><div class='text text-h6 text-weight-regular q-my-md'>Und <a href='https://codepen.io/hochstegerL03'>hier</a> geht es auch schon direkt zu unserem kleinen Profil, ein Follow wäre natürlich immer lieb an dieser Stelle.</div><hr class='q-my-lg' /></div>"
    }
  ]
}
